Autodesk.Revit.DB.ViewOrientation3D.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructs a new ViewOrientation3D using the input eye position, up and forward directions.
eyePosition:
The eye position
upDirection:
The up direction.  This vector will be normalized.  Up direction must be perpendicular to the forward direction.
forwardDirection:
The forward direction.  This vector will be normalized.  Forward direction must be perpendicular to the up direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or both of the input vectors cannot be normalized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
upDirection has zero length.
-or-
forwardDirection has zero length.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors upDirection and forwardDirection are not perpendicular.
Since:
2013